snlkuharlocal/src/Documents/СписаниеИзлишковГСМ/СписаниеИзлишковГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеИзлишковГСМ</name>
  <basedOn>Document.ПутевойЛист</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиГСМ</registerRecords>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>кДокументу</name>
    <type>
      <types>DocumentRef.ПутевойЛист</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ОстаткиГСМ/ОстаткиГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиГСМ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/СписаниеИзлишковГСМ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	Движения.ОстаткиГСМ.Записывать = Истина;
	Движение = Движения.ОстаткиГСМ.ДобавитьРасход();
	
	Движение.Период 	= Дата;
	Движение.Автомобиль = Автомобиль;	
	Движение.Количество = Количество;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПутевойЛист") Тогда		
		Автомобиль 	= ДанныеЗаполнения.Автомобиль;
		кДокументу	= ДанныеЗаполнения.Ссылка;
		Количество	= ДанныеЗаполнения.ОстатокТопливаВозврат;
		Дата		= ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры
